# 2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013. Ваша задача — вывести дату в текстовом виде, например:
# второе ноября 2013 года. Склонением пренебречь (2000 года, 2010 года)


date = input("Введите дату в формате XX.XX.XXXX: ")
date_list = date.split(".")
day = date_list[0]
month = date_list[1]
year = date_list[2]


day_list = \
    {
        "01": "Первое", "02": "Второе", "03": "Третье", "04": "Четвёртое", "05": "Пятое",
        "06": "Шестое", "07": "Седьмое", "08": "Восьмое", "09": "Девятое", "10": "Десятое",
        "11": "Одинадцатое", "12": "Двенадцатое", "13": "Тринадцатое", "14": "Четырнадцатое",
        "15": "Пятнадцатое", "16": "Шестнадцатое", "17": "Семнадцатое", "18": "Восемнадцатое",
        "19": "Девятнадцатое", "20": "Двадцатое", "21": "Двадцать первое", "22": "Двадцать второе",
        "23": "Двадцать третье", "24": "Двадцать четвёртое", "25": "Двадцать пятое", "26": "Двадцать шестое",
        "27": "Двадцать седьмое", "28": "Двадцать восьмое", "29": "Двадцать девятое", "30": "Тридцатое",
        "31": "Тридцать первое"
    }

month_list = \
    {
        "01":"Января","02":"Февраля","03":"Марта","04":"Апреля",
        "05":"Мая","06":"Июня","07":"Июля","08":"Августа",
        "09":"Сентября","10":"Октября", "11":"Ноября","12":"Декабря"
    }


result_day = day_list[day]
result_month = month_list[month]

print(f"{result_day} {result_month} {year} года")



